src/Catalogs/ГруппыСчетчиков/ГруппыСчетчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыСчетчиков</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ПолныйКодДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>620</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьУстановитьПометкуУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольПоступленияДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоеВремяОтсутствияДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ГруппыСчетчиков/Forms/ФормаЭлемента/Module.bsl
&НаСервереБезКонтекста
Процедура УстановитьКонтрольПодчиненнымНаСервере(ДопУсловия, Ссылка)
	ЗаписатьДопУсловия(ДопУсловия, Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьДопУсловия(ДопУсловия, Ссылка)
	
	Если ДопУсловия <> Неопределено И ДопУсловия.Выполнить Тогда
		Если ДопУсловия.РежимУстановки = "Для элементов" Тогда
			ДляЭлементов = Истина;
			ДляГрупп = Ложь;
		ИначеЕсли ДопУсловия.РежимУстановки = "Для групп и элементов" Тогда
			ДляЭлементов = Истина;
			ДляГрупп = Истина;
		ИначеЕсли ДопУсловия.РежимУстановки = "Для групп" Тогда
			ДляЭлементов = Ложь;
			ДляГрупп = Истина;
		КонецЕсли;
		КонтрольПоступленияДанных = ДопУсловия.КонтрольПоступленияДанных;
		ДопустимоеВремяОтсутствияДанных = ДопУсловия.ДопустимоеВремяОтсутствияДанных;
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ГруппыСчетчиков.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА 1 В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				1
	|			ИЗ
	|				Справочник.ГруппыСчетчиков КАК ГруппыСчетчиковПодзапрос
	|			ГДЕ
	|				ГруппыСчетчиковПодзапрос.Родитель = ГруппыСчетчиков.Ссылка
	|			)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоГруппа
	|ИЗ
	|	Справочник.ГруппыСчетчиков КАК ГруппыСчетчиков
	|ГДЕ
	|	ГруппыСчетчиков.Родитель В ИЕРАРХИИ (&Ссылка)
	|";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа И ДляГрупп Тогда
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СпрОбъект.КонтрольПоступленияДанных = КонтрольПоступленияДанных;
			СпрОбъект.ДопустимоеВремяОтсутствияДанных = ДопустимоеВремяОтсутствияДанных;
			СпрОбъект.Записать();
		ИначеЕсли НЕ Выборка.ЭтоГруппа И ДляЭлементов Тогда
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СпрОбъект.КонтрольПоступленияДанных = КонтрольПоступленияДанных;
			СпрОбъект.ДопустимоеВремяОтсутствияДанных = ДопустимоеВремяОтсутствияДанных;
			СпрОбъект.Записать();
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьКонтрольПодчиненным(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КонтрольПоступленияДанных", Объект.КонтрольПоступленияДанных);
	ПараметрыОткрытия.Вставить("ДопустимоеВремяОтсутствияДанных", Объект.ДопустимоеВремяОтсутствияДанных);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьКонтрольПодчиненнымЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ГруппыСчетчиков.Форма.ФормаПередЗаписью", ПараметрыОткрытия,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКонтрольПодчиненнымЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		УстановитьКонтрольПодчиненнымНаСервере(РезультатЗакрытия, Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры
